<?php
return [
    'welcome'           => [
        'name'      => 'دفع النقود',
        'version'   => 'В 1.7',
        'title'     => 'مرحبًا بك في برنامج التثبيت!',
        'sub-title' => 'يمتلك الخادم جميع المتطلبات والأذونات لهذا التطبيق. قبل البدء ، نحتاج إلى بعض المعلومات حول قاعدة البيانات الخاصة بك:',
        'item1'     => 'اسم قاعدة البيانات',
        'item2'     => 'تسجيل الدخول إلى قاعدة البيانات',
        'item3'     => 'كلمة مرور قاعدة البيانات',
        'item4'     => 'مضيف قاعدة البيانات',
        'message'   => 'سنستخدم هذه المعلومات لتحديث ملف البيئة',
        'button'    => 'لنذهب !',

    ],
    'database'          => [
        'title'          => 'إعداد قاعدة البيانات',
        'sub-title'      => 'إذا كنت لا تعرف كيفية ملء هذا النموذج ، فاتصل بالاستضافة',
        'dbname-label'   => 'اسم قاعدة البيانات (حيث تريد أن يكون التطبيق الخاص بك)',
        'username-label' => 'اسم المستخدم (دخول قاعدة البيانات الخاصة بك)',
        'password-label' => 'كلمة المرور (كلمة مرور قاعدة البيانات الخاصة بك)',
        'host-label'     => 'اسم المضيف (يجب أن يكون "localhost" ، إذا كان لا يعمل اسأل المضيف)',
        'button'         => 'إرسال',
        'wait'           => 'قليل من الصبر ...',

    ],
    'database-error'    => [
        'title'     => 'خطأ في اتصال قاعدة البيانات',
        'sub-title' => 'لا يمكننا الاتصال بقاعدة البيانات باستخدام إعداداتك:',
        'item1'     => 'هل أنت متأكد من اسم المستخدم وكلمة المرور الخاصة بك؟',
        'item2'     => 'هل أنت متأكد من اسم المضيف الخاص بك؟',
        'item3'     => 'هل أنت متأكد من أن خادم قاعدة البيانات يعمل؟',
        'message'   => 'إذا لم تكن متأكدًا تمامًا من فهم جميع هذه الشروط ، فيجب عليك الاتصال بمضيفك.',
        'button'    => 'حاول ثانية !',

    ],
    'requirement-error' => [
        'title'       => 'هناك خطأ شرط',
        'requirement' => 'لا يمكننا تثبيت هذا التطبيق لأن متطلبات PHP هذه مفقودة:',
        'php-version' => 'يجب أن يكون إصدار PHP 5.5.9 على الأقل لكن إصدارك هو',
        'message'     => 'يجب إصلاح هذا الخطأ لمتابعة التثبيت!',

    ],
    'permission-error'  => [
        'title'     => 'هناك خطأ في الإذن',
        'sub-title' => 'لا يمكننا تثبيت هذا التطبيق لأن هذا المجلد غير قابل للكتابة:',
        'message'   => 'يجب إصلاح هذا الخطأ لمتابعة التثبيت!',

    ],
    'register'          => [
        'title'      => 'إنشاء المسؤول',
        'sub-title'  => 'الآن يجب عليك إدخال المعلومات لإنشاء مسؤول',
        'base-label' => 'ك',
        'message'    => 'ستحتاج إلى كلمة المرور لتسجيل الدخول ، لذا احتفظ بها في أمان!',
        'button'     => 'إرسال',

    ],
    'register-fields'   => [
        'first_name' => 'الاسم الاول',
        'last_name'  => 'الكنية',
        'email'      => 'البريد الإلكتروني',
        'password'   => 'كلمه السر',

    ],
    'end'               => [
        'title'     => 'نجاح التثبيت!',
        'sub-title' => 'التطبيق وتثبيته الآن ويمكنك استخدامه',
        'login'     => 'تسجيلك :',
        'password'  => 'كلمة السر خاصتك :',
        'button'    => 'تسجيل الدخول',

    ]];
